; domain
(define (domain sokoban)
        (:requirements :strips)
        (:predicates (sokoban ?x)                                                                   ;sokoban is at location x
                                 (crate ?x)                                                                     ;crate is at location x
                                 (leftOf ?x ?y)                                                                 ;location x is to the left of locaiton y
                                 (below ?x ?y)                                                                  ;location x is below location y
                                 (at ?x ?y)                                                                     ;object x is at location y
                                 (clear ?x))                                                                        ;x is a location

        (:action moveLeft
                :parameters (?sokoban ?x ?y)
                :precondition (and (sokoban ?sokoban)
                                                   (at ?sokoban ?x)
                                                   (leftOf ?y ?x)                                           ;location y is to the left of location x
                                                   (clear ?y))                                              ;and y is empty/clear, so move left to y
                :effect (and (at ?sokoban ?y) (clear ?x)
                                (not (at ?sokoban ?x)) (not (clear ?y))))

        (:action moveRight
                :parameters (?sokoban ?x ?y)
                :precondition (and (sokoban ?sokoban)
                                                        (at ?sokoban ?x)
                                                        (leftOf ?x ?y)                                            ;location x is to the left of y
                                                        (clear ?y))                                               ;and y is clear, so move right to y
                :effect (and (at ?sokoban ?y) (clear ?x)
                                (not (at ?sokoban ?x)) (not (clear ?y))))

        (:action moveUp
                :parameters (?sokoban ?x ?y)
                :precondition (and (sokoban ?sokoban)
                                                  (at ?sokoban ?x)
                                                  (below ?x ?y)                                              ;location x is below location y
                                                  (clear ?y))                                                ;and y is clear, so move up to y
                :effect (and (at ?sokoban ?y) (clear ?x)
                                (not (at ?sokoban ?x)) (not (clear ?y))))

        (:action moveDown
                :parameters (?sokoban ?x ?y)
                :precondition (and (sokoban ?sokoban)
                                                  (at ?sokoban ?x)
                                                  (below ?y ?x)                                              ;location y is below location x
                                                  (clear ?y))                                                ;and y is clear, so move down to y
                :effect (and (at ?sokoban ?y) (clear ?x)
                                (not (at ?sokoban ?x)) (not (clear ?y))))

        (:action pushLeft
                :parameters (?sokoban ?x ?y ?z ?crate)
                :precondition (and (sokoban ?sokoban)
                                                        (crate ?crate)
                                                        (leftOf ?y ?x)                                          ;location y is left of x
                                                        (leftOf ?z ?y)                                            ;z (destination for block) is left of where the block currently is
                                                        (at ?sokoban ?x)                                           ;sokoban player is at x
                                                        (at ?crate ?y)                                             ;crate is at y                                                                                                    
                                                        (clear ?z))                                                ;and location z is clear, so push crate left to z
                :effect (and (at ?sokoban ?y) (at ?crate ?z) 
                                (clear ?x) 
                                (not (at ?sokoban ?x)) 
                                (not (at ?crate ?y)) 
                                (not (clear ?z)) 
                                (not (clear ?y))))
                           
        (:action pushRight
                :parameters (?sokoban ?x ?y ?z ?crate)
                :precondition (and (sokoban ?sokoban)
                                                        (crate ?crate)
                                                        (leftOf ?x ?y)                                                ;x is left of y
                                                        (leftOf ?y ?z)                                                ;y is left of z
                                                        (at ?sokoban ?x)                                        ;sokoban is at x
                                                        (at ?crate ?y)                                                ;crate is at y
                                                        (clear ?z))                                                        ;z is clear, so push crate right to z
                :effect (and (at ?sokoban ?y) (at ?crate ?z) 
                                (clear ?x)
                                (not (at ?sokoban ?x))
                                (not (at ?crate ?y))
                                (not (clear ?z))
                                (not (clear ?y))))

        (:action pushUp
                :parameters (?sokoban ?x ?y ?z ?crate)
                :precondition (and (sokoban ?sokoban)
                                                        (crate ?crate)
                                                        (below ?x ?y)                                                ;x is below y
                                                        (below ?y ?z)                                                ;y is below z
                                                        (at ?sokoban ?x)                                        ;sokoban is at x
                                                        (at ?crate ?y)                                                ;crate is at y
                                                        (clear ?z))                                                        ;z is clear, so push crate up to z
                :effect (and (at ?sokoban ?y) (at ?crate ?z)
                                (clear ?x)
                                (not (at ?sokoban ?x))
                                (not (at ?crate ?y))
                                (not (clear ?y))
                                (not (clear ?z))))


        (:action pushDown
                :parameters (?sokoban ?x ?y ?z ?crate)
                :precondition (and (sokoban ?sokoban)
                                                        (crate ?crate)
                                                        (below ?y ?x)                                                ;y is below x
                                                        (below ?z ?y)                                                ;z is below y
                                                        (at ?sokoban ?x)                                        ;sokoban is at x
                                                        (at ?crate ?y)                                                ;crate is at y
                                                        (clear ?z))                                                        ;z is clear, so push crate down to z
                :effect (and (at ?sokoban ?y) (at ?crate ?z)
                                (clear ?x)
                                (not (at ?sokoban ?x))
                                (not (at ?crate ?y))
                                (not (clear ?y))
                                (not (clear ?z))))
)

; problem
(define (problem sokoban)
        (:domain sokoban)
        (:objects sokoban crate1 crate2 l10 l11 l12 l19 l20 l21 l22 l29 l30 l31 l40 l41 l42 l43 l48 l49 l50 l52 l57 l58 l59 l60 l61)
        (:init (sokoban sokoban)
                (crate crate1)
                (crate crate2)
                (leftOf l10 l11)
                (leftOf l11 l12)
                (leftOf l19 l20)
                (leftOf l20 l21)
                (leftOf l21 l22)
                (leftOf l29 l30)
                (leftOf l30 l31)
                (leftOf l40 l41)
                (leftOf l41 l42)
                (leftOf l42 l43)
                (leftOf l48 l49)
                (leftOf l49 l50)
                (leftOf l57 l58)
                (leftOf l58 l59)
                (leftOf l59 l60)
                (leftOf l60 l61)
                (below l19 l10)
                (below l20 l11)
                (below l21 l12)
                (below l29 l20)
                (below l30 l21)
                (below l31 l22)
                (below l40 l31)
                (below l49 l40)
                (below l50 l41)
                (below l52 l43)
                (below l57 l48)
                (below l58 l49)
                (below l59 l50)
                (below l61 l52)
                (at sokoban l40)
                (at crate1 l20)
                (at crate2 l30)
                (clear l10)
                (clear l11)
                (clear l12)
                (clear l19)
                (clear l21)
                (clear l22)
                (clear l29)
                (clear l31)
                (clear l41)
                (clear l42)
                (clear l43)
                (clear l48)
                (clear l49)
                (clear l50)
                (clear l52)
                (clear l57)
                (clear l58)
                (clear l59)
                (clear l60)
                (clear l61)
        )
        (:goal (and
                (or (at crate1 l41) (at crate2 l41) )
                (or (at crate1 l50) (at crate2 l50) )
        ))
)

; plan
1. (moveup sokoban l40 l31)
   deleted: (at sokoban l40) (clear l31)
   added: (at sokoban l31) (clear l40)
   goals met: 0 of 2
2. (moveup sokoban l31 l22)
   deleted: (at sokoban l31) (clear l22)
   added: (at sokoban l22) (clear l31)
   goals met: 0 of 2
3. (moveleft sokoban l22 l21)
   deleted: (at sokoban l22) (clear l21)
   added: (at sokoban l21) (clear l22)
   goals met: 0 of 2
4. (moveup sokoban l21 l12)
   deleted: (at sokoban l21) (clear l12)
   added: (at sokoban l12) (clear l21)
   goals met: 0 of 2
5. (moveleft sokoban l12 l11)
   deleted: (at sokoban l12) (clear l11)
   added: (at sokoban l11) (clear l12)
   goals met: 0 of 2
6. (moveleft sokoban l11 l10)
   deleted: (at sokoban l11) (clear l10)
   added: (at sokoban l10) (clear l11)
   goals met: 0 of 2
7. (movedown sokoban l10 l19)
   deleted: (at sokoban l10) (clear l19)
   added: (at sokoban l19) (clear l10)
   goals met: 0 of 2
8. (pushright sokoban l19 l20 l21 crate1)
   deleted: (at sokoban l19) (at crate1 l20) (clear l21)
   added: (at sokoban l20) (at crate1 l21) (clear l19)
   goals met: 0 of 2
9. (movedown sokoban l20 l29)
   deleted: (at sokoban l20) (clear l29)
   added: (at sokoban l29) (clear l20)
   goals met: 0 of 2
10. (pushright sokoban l29 l30 l31 crate2)
   deleted: (at sokoban l29) (at crate2 l30) (clear l31)
   added: (at sokoban l30) (at crate2 l31) (clear l29)
   goals met: 0 of 2
11. (moveleft sokoban l30 l29)
   deleted: (at sokoban l30) (clear l29)
   added: (at sokoban l29) (clear l30)
   goals met: 0 of 2
12. (moveup sokoban l29 l20)
   deleted: (at sokoban l29) (clear l20)
   added: (at sokoban l20) (clear l29)
   goals met: 0 of 2
13. (moveup sokoban l20 l11)
   deleted: (at sokoban l20) (clear l11)
   added: (at sokoban l11) (clear l20)
   goals met: 0 of 2
14. (moveright sokoban l11 l12)
   deleted: (at sokoban l11) (clear l12)
   added: (at sokoban l12) (clear l11)
   goals met: 0 of 2
15. (pushdown sokoban l12 l21 l30 crate1)
   deleted: (at sokoban l12) (at crate1 l21) (clear l30)
   added: (at sokoban l21) (at crate1 l30) (clear l12)
   goals met: 0 of 2
16. (moveright sokoban l21 l22)
   deleted: (at sokoban l21) (clear l22)
   added: (at sokoban l22) (clear l21)
   goals met: 0 of 2
17. (pushdown sokoban l22 l31 l40 crate2)
   deleted: (at sokoban l22) (at crate2 l31) (clear l40)
   added: (at sokoban l31) (at crate2 l40) (clear l22)
   goals met: 0 of 2
18. (pushdown sokoban l31 l40 l49 crate2)
   deleted: (at sokoban l31) (at crate2 l40) (clear l49)
   added: (at sokoban l40) (at crate2 l49) (clear l31)
   goals met: 0 of 2
19. (moveright sokoban l40 l41)
   deleted: (at sokoban l40) (clear l41)
   added: (at sokoban l41) (clear l40)
   goals met: 0 of 2
20. (movedown sokoban l41 l50)
   deleted: (at sokoban l41) (clear l50)
   added: (at sokoban l50) (clear l41)
   goals met: 0 of 2
21. (movedown sokoban l50 l59)
   deleted: (at sokoban l50) (clear l59)
   added: (at sokoban l59) (clear l50)
   goals met: 0 of 2
22. (moveleft sokoban l59 l58)
   deleted: (at sokoban l59) (clear l58)
   added: (at sokoban l58) (clear l59)
   goals met: 0 of 2
23. (moveleft sokoban l58 l57)
   deleted: (at sokoban l58) (clear l57)
   added: (at sokoban l57) (clear l58)
   goals met: 0 of 2
24. (moveup sokoban l57 l48)
   deleted: (at sokoban l57) (clear l48)
   added: (at sokoban l48) (clear l57)
   goals met: 0 of 2
25. (pushright sokoban l48 l49 l50 crate2)
   deleted: (at sokoban l48) (at crate2 l49) (clear l50)
   added: (at sokoban l49) (at crate2 l50) (clear l48)
   goals met: 1 of 2
26. (moveup sokoban l49 l40)
   deleted: (at sokoban l49) (clear l40)
   added: (at sokoban l40) (clear l49)
   goals met: 1 of 2
27. (moveup sokoban l40 l31)
   deleted: (at sokoban l40) (clear l31)
   added: (at sokoban l31) (clear l40)
   goals met: 1 of 2
28. (moveup sokoban l31 l22)
   deleted: (at sokoban l31) (clear l22)
   added: (at sokoban l22) (clear l31)
   goals met: 1 of 2
29. (moveleft sokoban l22 l21)
   deleted: (at sokoban l22) (clear l21)
   added: (at sokoban l21) (clear l22)
   goals met: 1 of 2
30. (moveleft sokoban l21 l20)
   deleted: (at sokoban l21) (clear l20)
   added: (at sokoban l20) (clear l21)
   goals met: 1 of 2
31. (movedown sokoban l20 l29)
   deleted: (at sokoban l20) (clear l29)
   added: (at sokoban l29) (clear l20)
   goals met: 1 of 2
32. (pushright sokoban l29 l30 l31 crate1)
   deleted: (at sokoban l29) (at crate1 l30) (clear l31)
   added: (at sokoban l30) (at crate1 l31) (clear l29)
   goals met: 1 of 2
33. (moveup sokoban l30 l21)
   deleted: (at sokoban l30) (clear l21)
   added: (at sokoban l21) (clear l30)
   goals met: 1 of 2
34. (moveright sokoban l21 l22)
   deleted: (at sokoban l21) (clear l22)
   added: (at sokoban l22) (clear l21)
   goals met: 1 of 2
35. (pushdown sokoban l22 l31 l40 crate1)
   deleted: (at sokoban l22) (at crate1 l31) (clear l40)
   added: (at sokoban l31) (at crate1 l40) (clear l22)
   goals met: 1 of 2
36. (pushdown sokoban l31 l40 l49 crate1)
   deleted: (at sokoban l31) (at crate1 l40) (clear l49)
   added: (at sokoban l40) (at crate1 l49) (clear l31)
   goals met: 1 of 2
37. (moveright sokoban l40 l41)
   deleted: (at sokoban l40) (clear l41)
   added: (at sokoban l41) (clear l40)
   goals met: 1 of 2
38. (moveright sokoban l41 l42)
   deleted: (at sokoban l41) (clear l42)
   added: (at sokoban l42) (clear l41)
   goals met: 1 of 2
39. (moveright sokoban l42 l43)
   deleted: (at sokoban l42) (clear l43)
   added: (at sokoban l43) (clear l42)
   goals met: 1 of 2
40. (movedown sokoban l43 l52)
   deleted: (at sokoban l43) (clear l52)
   added: (at sokoban l52) (clear l43)
   goals met: 1 of 2
41. (movedown sokoban l52 l61)
   deleted: (at sokoban l52) (clear l61)
   added: (at sokoban l61) (clear l52)
   goals met: 1 of 2
42. (moveleft sokoban l61 l60)
   deleted: (at sokoban l61) (clear l60)
   added: (at sokoban l60) (clear l61)
   goals met: 1 of 2
43. (moveleft sokoban l60 l59)
   deleted: (at sokoban l60) (clear l59)
   added: (at sokoban l59) (clear l60)
   goals met: 1 of 2
44. (pushup sokoban l59 l50 l41 crate2)
   deleted: (at sokoban l59) (at crate2 l50) (clear l41)
   added: (at sokoban l50) (at crate2 l41) (clear l59)
   goals met: 1 of 2
45. (movedown sokoban l50 l59)
   deleted: (at sokoban l50) (clear l59)
   added: (at sokoban l59) (clear l50)
   goals met: 1 of 2
46. (moveleft sokoban l59 l58)
   deleted: (at sokoban l59) (clear l58)
   added: (at sokoban l58) (clear l59)
   goals met: 1 of 2
47. (moveleft sokoban l58 l57)
   deleted: (at sokoban l58) (clear l57)
   added: (at sokoban l57) (clear l58)
   goals met: 1 of 2
48. (moveup sokoban l57 l48)
   deleted: (at sokoban l57) (clear l48)
   added: (at sokoban l48) (clear l57)
   goals met: 1 of 2
49. (pushright sokoban l48 l49 l50 crate1)
   deleted: (at sokoban l48) (at crate1 l49) (clear l50)
   added: (at sokoban l49) (at crate1 l50) (clear l48)
   goals met: 2 of 2
